/*
 * flexcan.c - FLEXCAN CAN controller driver
 *
 * Copyright (c) 2005-2006 Varma Electronics Oy
 * Copyright (c) 2009 Sascha Hauer, Pengutronix
 * Copyright (c) 2010 Marc Kleine-Budde, Pengutronix
 *
 * Based on code originally by Andrey Volkov <avolkov@varma-el.com>
 *
 * LICENCE:
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation version 2.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 */

#define USE_STRIM_FLEXCAN

#include <linux/netdevice.h>
#ifndef USE_STRIM_FLEXCAN
#include <linux/can.h>
#include <linux/can/dev.h>
#endif
#include <linux/can/error.h>
#ifndef USE_STRIM_FLEXCAN
#include <linux/can/led.h>
#endif
#include <linux/can/platform/flexcan.h>
#include <linux/clk.h>
#include <linux/delay.h>
#ifndef USE_STRIM_FLEXCAN
#include <linux/if_arp.h>
#include <linux/if_ether.h>
#endif
#include <linux/interrupt.h>
#include <linux/io.h>
#include <linux/kernel.h>
#include <linux/list.h>
#include <linux/mfd/syscon.h>
#include <linux/mfd/syscon/imx6q-iomuxc-gpr.h>
#include <linux/module.h>
#include <linux/of.h>
#include <linux/of_device.h>
#include <linux/of_gpio.h>
#include <linux/platform_device.h>
#include <linux/pinctrl/consumer.h>

#define FLEXCAN_IFLAG_BUF(x)		BIT(x)
#define FLEXCAN_IFLAG_RX_FIFO_OVERFLOW	BIT(7)
#define FLEXCAN_IFLAG_RX_FIFO_WARN	BIT(6)
#define FLEXCAN_IFLAG_RX_FIFO_AVAILABLE	BIT(5)
#define FLEXCAN_IFLAG_DEFAULT \
	(FLEXCAN_IFLAG_RX_FIFO_OVERFLOW | FLEXCAN_IFLAG_RX_FIFO_AVAILABLE | \
	 FLEXCAN_IFLAG_BUF(FLEXCAN_TX_BUF_ID))

/* FLEXCAN message buffers */
#define FLEXCAN_MB_CNT_CODE(x)		(((x) & 0xf) << 24)
#define FLEXCAN_MB_CNT_SRR		BIT(22)
#define FLEXCAN_MB_CNT_IDE		BIT(21)
#define FLEXCAN_MB_CNT_RTR		BIT(20)
#define FLEXCAN_MB_CNT_LENGTH(x)	(((x) & 0xf) << 16)
#define FLEXCAN_MB_CNT_TIMESTAMP(x)	((x) & 0xffff)

#define FLEXCAN_MB_CODE_MASK		(0xf0ffffff)

/*
 * FLEXCAN hardware feature flags
 *
 * Below is some version info we got:
 *    SOC   Version   IP-Version  Glitch-  [TR]WRN_INT
 *                                Filter?   connected?
 *   MX25  FlexCAN2  03.00.00.00     no         no
 *   MX28  FlexCAN2  03.00.04.00    yes        yes
 *   MX35  FlexCAN2  03.00.00.00     no         no
 *   MX53  FlexCAN2  03.00.00.00    yes         no
 *   MX6s  FlexCAN3  10.00.12.00    yes        yes
 *
 * Some SOCs do not have the RX_WARN & TX_WARN interrupt line connected.
 */
#define FLEXCAN_HAS_V10_FEATURES	BIT(1) /* For core version >= 10 */
#define FLEXCAN_HAS_BROKEN_ERR_STATE	BIT(2) /* [TR]WRN_INT not connected */
#define FLEXCAN_HAS_ERR005829		BIT(3) /* have errata ERR005829 */

#ifdef USE_STRIM_FLEXCAN

#define FLEXCAN_GPIO_0             (106)
#define FLEXCAN_GPIO_1             (80)

 /* Flexcan precalc bitrate settings */
#define FLEXCAN_BTRT_1000_SP866    (0x01290005)
#define FLEXCAN_BTRT_1000_SP800    (0x012a0004)
#define FLEXCAN_BTRT_1000_SP733    (0x01230004)
#define FLEXCAN_BTRT_1000_SP700    (0x02120002)

#define FLEXCAN_BTRT_1000          (0x01290005) /* Canconfig calculated value */
#define FLEXCAN_BTRT_500           (0x023b0006) /* Canconfig calculated value */
#define FLEXCAN_BTRT_250           (0x053b0006) /* Canconfig calculated value */
#define FLEXCAN_BTRT_125           (0x0b3b0006) /* Canconfig calculated value */
#define FLEXCAN_BTRT_100           (0x0e3b0006) /* Canconfig calculated value */
#define FLEXCAN_BTRT_DFLT          FLEXCAN_BTRT_1000

#define FLEXCAN_BTRT_MASK          (0xFFFF0007)

#define FLEXCAN_AUTOSET_WORK       BIT(0)   /* Идет настройка скорости */
#define FLEXCAN_AUTOSET_END        BIT(1)   /* Настройка скорости завершена */
#define FLEXCAN_AUTOSET_ERR        BIT(2)   /* Ошибка при текущей скорости */
#define FLEXCAN_AUTOSET_OK         BIT(3)   /* Текущая скорость верна */

#define FLEXCAN_DEV_FIRST          (0)
#define FLEXCAN_DEV_COUNT          (2)

#define FLEXCAN_BUF_RECV_CAP       (262144) //131072
#define FLEXCAN_BUF_SEND_CAP       (128)

#define FLEXCAN_BUF_RECV_MASK      ((&f_brecv[dev_num])->capacity - 1)
#define FLEXCAN_BUF_SEND_MASK      ((&f_bsend[dev_num])->capacity - 1)

#define FLEXCAN_IRQ_BASE           (142)

#define init_MUTEX(LOCKNAME)       sema_init(LOCKNAME,1);

#endif

/* Structure of the hardware registers */
struct flexcan_regs {
	u32 mcr;		/* 0x00 */
	u32 ctrl;		/* 0x04 */
	u32 timer;		/* 0x08 */
	u32 _reserved1;		/* 0x0c */
	u32 rxgmask;		/* 0x10 */
	u32 rx14mask;		/* 0x14 */
	u32 rx15mask;		/* 0x18 */
	u32 ecr;		/* 0x1c */
	u32 esr;		/* 0x20 */
	u32 imask2;		/* 0x24 */
	u32 imask1;		/* 0x28 */
	u32 iflag2;		/* 0x2c */
	u32 iflag1;		/* 0x30 */
	u32 crl2;		/* 0x34 */
	u32 esr2;		/* 0x38 */
	u32 imeur;		/* 0x3c */
	u32 lrfr;		/* 0x40 */
	u32 crcr;		/* 0x44 */
	u32 rxfgmask;		/* 0x48 */
	u32 rxfir;		/* 0x4c */
	u32 _reserved3[12];
	struct flexcan_mb cantxfg[64];
};

struct flexcan_devtype_data {
	u32 features;	/* hardware controller features */
};

#ifdef USE_STRIM_FLEXCAN
typedef struct {
    unsigned int n_push, n_pop, n_save_pop;
} flexcan_nbuf_t;

struct flexcan_frame_mb {
    struct flexcan_mb mb;
    struct timeval time;
};

struct flexcan_c_device {
/* Имя устройства. Это же имя отдается файлу устройства в /dev и /proc */
    char name[IFNAMSIZ];

/* Адрес начала блока памяти устройства. Сохраняется при регистрации устройства.
 * Используется для чтения регистров устройства с помощью struct flexcan_regs */
    void __iomem *base;

/* Содержит major и minor номер зарегистрированного устройства.
 * Номера извлекаются макросами MAJOR(dev_t devt) и MINOR(dev_t devt).
 * Номер формируется при регистрации автоматически и через MKDEV(major, minor) */
    dev_t devt;

/* Флаг открытия файла устройства. Защита от множественного доступа к файлу
