/**
 * @file flexcan.c
 * @brief FLEXCAN CAN controller driver
 * @details This file is driver for work with flexcan controller
 * @version 1.1.25
 * @date 04.04.2015
 * @author Mikita Dzivakou
 * @copyright (c) 2005-2006 Varma Electronics Oy
 * @copyright (c) 2009 Sascha Hauer, Pengutronix
 * @copyright (c) 2010 Marc Kleine-Budde, Pengutronix
 * @copyright (c) 2015 Mikita Dzivakou, Strim-tech
 * @verbatim
   LICENCE:
   This program is free software; you can redistribute it and/or
   modify it under the terms of the GNU General Public License as
   published by the Free Software Foundation version 2.
   
   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.
 * @endverbatim
 */

// #include <linux/netdevice.h>
#include <linux/can/error.h>
#include <linux/can/platform/flexcan.h>
#include <linux/clk.h>
#include <linux/delay.h>
#include <linux/if_arp.h>
#include <linux/if_ether.h>
#include <linux/interrupt.h>
#include <linux/io.h>
#include <linux/kernel.h>
#include <linux/list.h>
#include <linux/module.h>
#include <linux/platform_device.h>
#include <linux/time.h>

#include <linux/types.h>
#include <linux/fs.h>
#include <linux/proc_fs.h>
#include <linux/uaccess.h>
#include <linux/device.h>
#include <linux/cdev.h>
#include <linux/kdev_t.h>
#include <linux/version.h>
#include <asm/io.h>

#define FLEXCAN_ESR_IDLE               BIT(7)
#define FLEXCAN_ESR_TXRX               BIT(6)
#define FLEXCAN_EST_FLT_CONF_SHIFT     (4)
#define FLEXCAN_ESR_FLT_CONF_MASK      (0x3 << FLEXCAN_EST_FLT_CONF_SHIFT)
#define FLEXCAN_ESR_FLT_CONF_ACTIVE    (0x0 << FLEXCAN_EST_FLT_CONF_SHIFT)
#define FLEXCAN_ESR_FLT_CONF_PASSIVE   (0x1 << FLEXCAN_EST_FLT_CONF_SHIFT)
#define FLEXCAN_ESR_BOFF_INT           BIT(2)
#define FLEXCAN_ESR_ERR_INT            BIT(1)
#define FLEXCAN_ESR_WAK_INT            BIT(0)

#define FLEXCAN_ESR_ERR_BUS 			(FLEXCAN_ESR_BIT1_ERR | FLEXCAN_ESR_BIT0_ERR | FLEXCAN_ESR_ACK_ERR | \
										 FLEXCAN_ESR_CRC_ERR | FLEXCAN_ESR_FRM_ERR | FLEXCAN_ESR_STF_ERR)
#define FLEXCAN_ESR_ERR_STATE 			(FLEXCAN_ESR_TWRN_INT | FLEXCAN_ESR_RWRN_INT | FLEXCAN_ESR_BOFF_INT)
#define FLEXCAN_ESR_ERR_ALL 			(FLEXCAN_ESR_ERR_BUS | FLEXCAN_ESR_ERR_STATE)

/* FLEXCAN interrupt flag register (IFLAG) bits */
#define FLEXCAN_TX_BUF_ID                  8
#define FLEXCAN_IFLAG_BUF(x)               BIT(x)
#define FLEXCAN_IFLAG_RX_FIFO_OVERFLOW     BIT(7)
#define FLEXCAN_IFLAG_RX_FIFO_WARN	        BIT(6)
#define FLEXCAN_IFLAG_RX_FIFO_AVAILABLE    BIT(5)

#define FLEXCAN_IFLAG_DEFAULT          (FLEXCAN_IFLAG_RX_FIFO_OVERFLOW | FLEXCAN_IFLAG_RX_FIFO_AVAILABLE | FLEXCAN_IFLAG_BUF(FLEXCAN_TX_BUF_ID))

/* FLEXCAN message buffers */
#define FLEXCAN_MB_CNT_CODE(x)         (((x) & 0xf) << 24)
#define FLEXCAN_MB_CNT_SRR             BIT(22)
#define FLEXCAN_MB_CNT_IDE             BIT(21)
#define FLEXCAN_MB_CNT_RTR             BIT(20)
#define FLEXCAN_MB_CNT_LENGTH(x)       (((x) & 0xf) << 16)
#define FLEXCAN_MB_CNT_TIMESTAMP(x)    ((x) & 0xffff)

#define FLEXCAN_MB_CODE_MASK           (0xf0ffffff)


#define FLEXCAN_BTRT_1000_SP866    (0x01290005)
#define FLEXCAN_BTRT_1000_SP800    (0x012a0004)
#define FLEXCAN_BTRT_1000_SP733    (0x01230004)
#define FLEXCAN_BTRT_1000_SP700    (0x02120002)

#define FLEXCAN_BTRT_1000          (0x01290005)
#define FLEXCAN_BTRT_500           (0x023b0006)		/* Предварительно, настройка рассчитана через canconfig */
#define FLEXCAN_BTRT_250           (0x053b0006)		/* Предварительно, настройка рассчитана через canconfig */
#define FLEXCAN_BTRT_125           (0x0b3b0006)		/* Предварительно, настройка рассчитана через canconfig */
#define FLEXCAN_BTRT_100           (0x0e3b0006)		/* Предварительно, настройка рассчитана через canconfig */
#define FLEXCAN_BTRT_DFLT          FLEXCAN_BTRT_1000

#define FLEXCAN_BTRT_MASK          (0xFFFF0007)

#define FLEXCAN_DRV_NAME           "flexcan"
#define FLEXCAN_DRV_VER            "1.2.68"

#define FLEXCAN_DEV_FIRST          (0)
#define FLEXCAN_DEV_COUNT          (2)

#define FLEXCAN_BUF_RECV_CAP       (262144)
#define FLEXCAN_BUF_SEND_CAP       (64)

#define FLEXCAN_BUF_RECV_MASK      (fimx6d.f_dev[dev_num].buf_recv_size - 1)
#define FLEXCAN_BUF_SEND_MASK      (fimx6d.f_dev[dev_num].buf_send_size - 1)

#define FLEXCAN_IRQ_BASE           (142)

#define init_MUTEX(LOCKNAME) sema_init(LOCKNAME,1);

/* Structure of the hardware registers */
struct flexcan_regs {
	u32 mcr;		/* 0x00 */
	u32 ctrl;		/* 0x04 */
	u32 timer;		/* 0x08 */
	u32 _reserved1;		/* 0x0c */
	u32 rxgmask;		/* 0x10 */
	u32 rx14mask;		/* 0x14 */
	u32 rx15mask;		/* 0x18 */
	u32 ecr;		/* 0x1c */
	u32 esr;		/* 0x20 */
	u32 imask2;		/* 0x24 */
	u32 imask1;		/* 0x28 */
	u32 iflag2;		/* 0x2c */
	u32 iflag1;		/* 0x30 */
	u32 crl2;		/* 0x34 */
	u32 esr2;		/* 0x38 */
	u32 _reserved2[2];
	u32 crcr;		/* 0x44 */
	u32 rxfgmask;		/* 0x48 */
	u32 rxfir;		/* 0x4c */
	u32 _reserved3[12];
	struct flexcan_mb cantxfg[64];
};

enum flexcan_ip_version {
	FLEXCAN_VER_3_0_0,
	FLEXCAN_VER_3_0_4,
	FLEXCAN_VER_10_0_12,
};

static struct can_bittiming_const flexcan_bittiming_const = {
	.name = FLEXCAN_DRV_NAME,
	.tseg1_min = 4,
	.tseg1_max = 16,
	.tseg2_min = 2,
	.tseg2_max = 8,
	.sjw_max = 4,
	.brp_min = 1,
	.brp_max = 256,
	.brp_inc = 1,
};

typedef struct {
	unsigned int n_push, n_pop, n_save_pop;
} circle_buf_t;

struct flexcan_frame_mb {
	struct flexcan_mb mb;
	struct timeval time;
};

struct flexcan_chardev {

/* Имя устройства.
 * Это же имя отдается файлу устройства в /dev и /proc */
	char name[IFNAMSIZ];

/* Содержит major и minor номер зарегистрированного устройства
 * Номера извлекаются макросами MAJOR(dev_t devt) и MINOR(dev_t devt)
 * Номер формируется при регистрации устройства автоматически
 * Так же формируется макросом MKDEV(major, minor) */
	dev_t f_devt;

/* Адрес начала блока памяти устройства
